export const cameras = [
  { id: '440606240822050303010300015037871', name: '东丫荣地' },
  { id: '440606240903050303010300015057281', name: '太帅庙' },
  { id: '440606240819050303010300015012341', name: '新加坡场' },
  { id: '440606240529050303010300014663101', name: '基站02' },
  { id: '440606240409050303010300014299571', name: '基站' },
  { id: '440606240409050303010300014298871', name: '百里' },
  { id: '440606240822050303010300015037811', name: '路工塘' },
  { id: '440606240409050303010300014299851', name: '信用社' },
  { id: '440606240820050303010300015012981', name: '建公园浆' }
];

export const baseUrl = 'http://your-base-url:8084';

export const getVideoUrl = (cameraId) => {
  return `${baseUrl}/shipinyun/${cameraId}.m3u8`;
};